lim14373/Archivos-Trabajo-de-Graduaci-n-2018-Swarm-Robotic/Programar PIC32/Programas C/Programas de Prueba/6. Progra Final Versión 2.c
/*
 * File:   main.c
 * Author: Javier Lima
 *
 * Created on 28 de abril 2018, 08:26 PM
 */


#define Usuario "Megaproyecto"          // Nombre del Router
#define LargoUs 12                      // Cantidad de caracteres del Usuario, sin contar comillas
#define Contrasena "ABC1234567"         // Contraseña del Router
#define LargoCn 10                      // Cantidad de caracteres de la Contraseña
#define IP "192.168.1.2"                // IP del cliente TCP (Ordenador)
#define LargoIP 11                      // Cantidad de caracteres de la IP
#define Puerto "5400"                   // Puerto TCP
#define LargoPt 4                       // Cantidad de caracteres del Puerto

#include <string.h>
#include <stdio.h>
#include <p32xxxx.h>
#include <stdlib.h>
#include <math.h>
#include "../sys/attribs.h"
// PIC32MX250F128B Configuration Bit Settings

// 'C' source line config statements

// DEVCFG3
// USERID = No Setting
#pragma config PMDL1WAY = ON            // Peripheral Module Disable Configuration (Allow multiple reconfigurations)
#pragma config IOL1WAY = ON             // Peripheral Pin Select Configuration (Allow multiple reconfigurations)
#pragma config FUSBIDIO = OFF           // USB USID Selection (Controlled by Port Function)
#pragma config FVBUSONIO = OFF          // USB VBUS ON Selection (Controlled by Port Function)

// DEVCFG2
#pragma config FPLLIDIV = DIV_2         // PLL Input Divider (2x Divider)
#pragma config FPLLMUL = MUL_20         // PLL Multiplier (20x Multiplier)
#pragma config UPLLIDIV = DIV_12        // USB PLL Input Divider (12x Divider)
#pragma config UPLLEN = OFF             // USB PLL Enable (Disabled and Bypassed)
#pragma config FPLLODIV = DIV_2         // System PLL Output Clock Divider (PLL Divide by 2)

// DEVCFG1
#pragma config FNOSC = FRCPLL           // Oscillator Selection Bits (Fast RC Osc with PLL)
#pragma config FSOSCEN = OFF            // Secondary Oscillator Enable (Disabled)
#pragma config IESO = OFF               // Internal/External Switch Over (Disabled)
#pragma config POSCMOD = OFF            // Primary Oscillator Configuration (Primary osc disabled)
#pragma config OSCIOFNC = OFF           // CLKO Output Signal Active on the OSCO Pin (Disabled)
#pragma config FPBDIV = DIV_1           // Peripheral Clock Divisor (Pb_Clk is Sys_Clk/1)
#pragma config FCKSM = CSDCMD           // Clock Switching and Monitor Selection (Clock Switch Disable, FSCM Disabled)
#pragma config WDTPS = PS1048576        // Watchdog Timer Postscaler (1:1048576)
#pragma config WINDIS = OFF             // Watchdog Timer Window Enable (Watchdog Timer is in Non-Window Mode)
#pragma config FWDTEN = OFF             // Watchdog Timer Enable (WDT Disabled (SWDTEN Bit Controls))
#pragma config FWDTWINSZ = WINSZ_25     // Watchdog Timer Window Size (Window Size is 25%)

// DEVCFG0
#pragma config JTAGEN = OFF             // JTAG Enable (JTAG Disabled)
#pragma config ICESEL = ICS_PGx1        // ICE/ICD Comm Channel Select (Communicate on PGEC1/PGED1)
#pragma config PWP = OFF                // Program Flash Write Protect (Disable)
#pragma config BWP = OFF                // Boot Flash Write Protect bit (Protection Disabled)
#pragma config CP = OFF                 // Code Protect (Protection Disabled)

// SYSTEM CLOCK 40MHz
// Peripheral Clock 40MHz
#include <xc.h>

#define BDOS 0x0400                     // Driver Motor B2 - RB10 - Pin 21
#define BUNO 0x0800                     // Driver Motor B1 - RB11 - Pin 22
#define AUNO 0x2000                     // Driver Motor A1 - RB13 - Pin 24
#define ADOS 0x4000                     // Driver Motor A2 - RB14 - Pin 25

#define LED1 0x0010                     // Led 1 - RA4 - Pin 12
#define LED2 0x0020                     // Led 2 - RB5 - Pin 14
#define LED3 0x0080                     // Led 3 - RB7 - Pin 16

void EnviarCaracter(char c);
void EnviarCadena(char c[], int a);
void IntTimer1(void);
void IntTimer4(void);
void IntTimer5(void);
void IntUart1(void);
void IntCN(void);
void SentidoLlantas(void);
void Velocidad(void);
void EnviarPasos(void);
void EnviarSentidos(void);
void EnviarTiempos(void);
void Radar(void);
void InicializarESP(void);

char charIn;
int i = 0;
int j = 0;
int k = 0;
int PasosDerF = 0;
int PasosIzqF = 0;
int PasosDerB = 0;
int PasosIzqB = 0;
int contTiemposIzq = 0;
int contTiemposDer = 0;
int DifTiempos = 0;
long TiempoActual = 0;
long TiempoPasadoDer = 0;
long TiempoPasadoIzq = 0;
long PromTiempos = 0;
int TiemposPasosDer[] = {0,0,0,0,0,0};
int TiemposPasosIzq[] = {0,0,0,0,0,0};
char SentidoActualIzq;
char SentidoActualDer;

char smsR[50];
int contR = 0;
int Revision = 0;

int dmil = 0;
int mil = 0;
int cen = 0;
int dec = 0;
int uni = 0;
int var;

int PasosESP = 1;
int InitESP = 1;

int blink = 0;

int ContarSonico1 = 0;
int ContarSonico2 = 0;
int TiempoSonico1 = 0;
int TiempoSonico2 = 0;
int Mandar = 0;
int Grados = 146;
int g = 0;

int Rutina = 0;

//Variables de prueba

int Enviando = 0;

void main(void) {
    
    //CLOCK INTERNO CON 40kHz en PBCLK
    
    OSCTUNbits.TUN  = 0b000000;         // Center Freq. Oscilator at 8MHz
    OSCCONbits.PLLODIV = 0b001;         // PLL out divided by 2
    OSCCONbits.FRCDIV = 0b000;          // FRC divided by 1
    OSCCONbits.SOSCRDY = 0b0;           // Secondary Osc is warming or turned off
    OSCCONbits.PBDIVRDY = 0b1;          // PBDIV bits can be written
    OSCCONbits.PBDIV = 0b00;            // PBCLK is SYSCLK divided by 1
    OSCCONbits.PLLMULT = 0b101;         // Clock is multiplied by 20
    OSCCONbits.COSC = 0b001;            // FRCPLL
    OSCCONbits.NOSC = 0b001;            // FRCPLL
    OSCCONbits.CLKLOCK = 0b0;           // Clock and PLL can be modify
    OSCCONbits.ULOCK = 0b0;             // USB is out of lock or is disabled
    OSCCONbits.SLOCK = 0b0;             // PLL Lock Status
    OSCCONbits.SLPEN = 0b0;             // Will enter in idle mode when WAIT is executed
    OSCCONbits.CF = 0b0;                // No clock failure has been detected
    OSCCONbits.UFRCEN = 0b0;            // Use the primary Osc or USB PLL as the USB clock source
    OSCCONbits.SOSCEN = 0b0;            // Disable secondary oscilator
    OSCCONbits.OSWEN = 0b0;             // Oscilator switch is complete  
    
