lim14373/Archivos-Trabajo-de-Graduaci-n-2018-Swarm-Robotic/Programar PIC32/Programas C/Programas de Prueba/6. Progra Final Versión 2.c
    //CONFIGURACIÓN DE ENTRADAS Y SALIDAS
    
    ANSELA = 0;                         // Pines Digitales Puerto A
    ANSELB = 0;                         // Pines Digitales Puerto B
    
    TRISAbits.TRISA0 = 1;               // Pin 2 como entrada - ENC DERECHA A
    TRISAbits.TRISA1 = 1;               // Pin 3 como entrada - ENC DERECHA B
    TRISBbits.TRISB0 = 1;               // Pin 4 como entrada - ENC IZQUIERDA B
    TRISBbits.TRISB1 = 1;               // Pin 5 como entrada - ENC IZQUIERDA A
    TRISBbits.TRISB2 = 1;               // Pin 6 como entrada - UART RECEIVER
    TRISBbits.TRISB3 = 0;               // Pin 7 como salida - UART TRANSMITER
    TRISAbits.TRISA2 = 1;               // Pin 9 como entrada - MAXSONAR 1 
    TRISAbits.TRISA3 = 1;               // Pin 10 como entrada - MAXSONAR 2
    TRISBbits.TRISB4 = 1;               // Pin 11 como entrada - MAXSONAR 3
    TRISAbits.TRISA4 = 0;               // Pin 12 como salida - LED 1
    TRISBbits.TRISB5 = 0;               // Pin 14 como salida - LED 2
    TRISBbits.TRISB7 = 0;               // Pin 16 como salida - LED 3
    TRISBbits.TRISB8 = 0;               // Pin 17 como salida - SERVO MOTOR
    TRISBbits.TRISB9 = 0;               // Pin 18 como salida - DRIVER PWM B
    TRISBbits.TRISB10 = 0;              // Pin 21 como salida - DRIVER B2
    TRISBbits.TRISB11 = 0;              // Pin 22 como salida - DRIVER B1
    TRISBbits.TRISB13 = 0;              // Pin 24 como salida - DRIVER A1
    TRISBbits.TRISB14 = 0;              // Pin 25 como salida - DRIVER A2
    TRISBbits.TRISB15 = 0;              // Pin 26 como salida - DRIVER PWM A
    
    // RE-MAPEO DE PINES
    
    CFGCONbits.IOLOCK = 0b0;            // IOLock is disabled.
    
    U1RXRbits.U1RXR = 0b0100;           // Se asigna RPB2 a U1RX - Receiver Uart - pin 6
    RPB3Rbits.RPB3R = 0b0001;           // Se asigna U1TX a RPB3 - Transmiter Uart - pin 7
    
    RPB8Rbits.RPB8R = 0b0101;           // Se asigna OC2 a RPB8 - Servo - pin 17
    RPB9Rbits.RPB9R = 0b0101;           // Se asigna OC3 a RPB9 - Motor PWM B - pin 18
    RPB10Rbits.RPB10R = 0b0000;         // No se asigna nada - Motor Bin2  - pin 21
    RPB11Rbits.RPB11R = 0b0000;         // No se asigna nada - Motor Bin1 - pin 22
    RPB13Rbits.RPB13R = 0b0000;         // No se asigna nada - Motor Ain1 - pin 24
    RPB14Rbits.RPB14R = 0b0000;         // No se asigna nada - Motor Ain2 - pin 25
    RPB15Rbits.RPB15R = 0b0101;         // Se asigna OC1 a RPB15 - Motor PWM A - pin 26
    
    // CONFIGURACIÓN DE UART 1
    
    U1BRG = 4;                          // BaudRate = 2000000 at Fpb = 40 MHZ with BRGH = 1
    
    U1MODEbits.PDSEL = 0b00;            // No parity
    U1MODEbits.ON = 0b0;                // UART Disabled
    U1MODEbits.SIDL = 0b0;
    U1MODEbits.IREN = 0b0;
    U1MODEbits.RTSMD = 0b1;             // Simplex ModeA
    U1MODEbits.UEN = 0b00;
    U1MODEbits.WAKE = 0b0;
    U1MODEbits.LPBACK = 0b0;
    U1MODEbits.ABAUD = 0b0;
    U1MODEbits.RXINV = 0b0;
    U1MODEbits.BRGH = 0b1;              // High Speed Mode
    U1MODEbits.STSEL = 0b0;             // 1 stop bit   
    
    U1STAbits.URXISEL = 0b00;           // Se realiza una interrupción por cada caracter recibido
    U1STAbits.URXEN = 1;                // habilitar recepcion
    U1STAbits.UTXEN = 1;                // habilitar transmision
    
    // SE CONFIGURA TIMER 1
    
    T1CONbits.ON = 0b0;                 // Timer 1 is disabled
    T1CONbits.SIDL = 0b0;
    T1CONbits.TWDIS = 0b0;
    T1CONbits.TWIP = 0b0;
    T1CONbits.TGATE = 0b0;
    T1CONbits.TCKPS = 0b00;             // Prescaler at 1:1
    T1CONbits.TSYNC = 0b0;
    T1CONbits.TCS = 0b0;                // Internal Peripheral Clock as Timer Clock Source  
    
    //TIMER 2 ES PARA CONTROLAR LOS MOTORES
    
    T2CONbits.ON = 0b0;                 // Timer 2 is disabled
    T2CONbits.SIDL = 0b0;
    T2CONbits.TGATE = 0b0;
    T2CONbits.TCKPS = 0b100;            // Prescaler at 1:16
    T2CONbits.T32 = 0b0;
    T2CONbits.TCS = 0b0;                // Internal Peripheral Clock as Timer Clock Source
    
    //TIMER 3 ES PARA CONTROLAR AL SERVO
    
    T3CONbits.ON = 0b0;                 // Timer 3 is disabled
    T3CONbits.SIDL = 0b0;
    T3CONbits.TGATE = 0b0;
    T3CONbits.TCKPS = 0b011;            // Prescaler at 1:8
    T3CONbits.TCS = 0b0;                // Internal Peripheral Clock as Timer Clock Source
    
    //TIMER 4 ES PARA MEDIR LOS SENSORES DE DISTANCIA CADA 50ms
    
    T4CONbits.ON = 0b0;                 // Timer 4 is disabled
    T4CONbits.SIDL = 0b0;
    T4CONbits.TGATE = 0b0;
    T4CONbits.TCKPS = 0b101;            // Prescaler at 1:32
    T4CONbits.T32 = 0b0;
    T4CONbits.TCS = 0b0;                // Internal Peripheral Clock as Timer Clock Source
    
    //TIMER 5 ES PARA MEDIR EL TIEMPO DE LA SEÑAL PWM DE SENSORES DE DISTANCIA
    
    T5CONbits.ON = 0b0;                 // Timer 5 is disabled
    T5CONbits.SIDL = 0b0;
    T5CONbits.TGATE = 0b0;
    T5CONbits.TCKPS = 0b000;            // Prescaler at 1:1
    T5CONbits.TCS = 0b0;                // Internal Peripheral Clock as Timer Clock Source
    
    //PWM 1 PARA CONTROLAR MOTOR A
    
    OC1CONbits.ON = 0b0;                // OC1 is disabled
    OC1CONbits.SIDL = 0b0;
    OC1CONbits.OC32 = 0b0;
    OC1CONbits.OCFLT = 0b0;
    OC1CONbits.OCTSEL = 0b0;            // Timer 2 is the clock source
    OC1CONbits.OCM = 0b110;             // Estandar PWM
    
    //PWM 2 PARA CONTROLAR SERVO
    
    OC2CONbits.ON = 0b0;                // OC2 is disabled
    OC2CONbits.SIDL = 0b0;
    OC2CONbits.OC32 = 0b0;
    OC2CONbits.OCFLT = 0b0;
    OC2CONbits.OCTSEL = 0b1;            // Timer 3 is the clock source
    OC2CONbits.OCM = 0b110;             // Estandar PWM
    
    //PWM 3 PARA CONTROLAR MOTOR B
    
    OC3CONbits.ON = 0b0;                // OC3 is disabled
    OC3CONbits.SIDL = 0b0;
    OC3CONbits.OC32 = 0b0;
    OC3CONbits.OCFLT = 0b0;
    OC3CONbits.OCTSEL = 0b0;            // Timer 2 is the clock source
    OC3CONbits.OCM = 0b110;             // Estandar PWM
    
    // Definición de periodos de Timers
    // FreqPWM = FreqPB/[(PRx+1)*(TMR Prescale Value)]
    
    PR1 = 3999;                         // Cada 100uS se activa la interrupción del T1
    PR2 = 4999;                         // Freq de 500Hz (Motores)
    PR3 = 16666;                        // Freq de 300Hz (Servo) 4000-11300 / 0° - 140°
    PR4 = 62499;                        // Freq de 20Hz (Lectura de MaxSonar)
    PR5 = 998;                          // Freq de 40kHz (Conteo de tiempo de PWM MaxSonar)
    
    // Definición de Duty Cycle de PWM's
    
    OC1RS = 0;
    OC2RS = 4000;                       // 24% of PR3 to 67.8% of PR3 for Servo Traxxas
    OC3RS = 0;                      
    
    //INTERRUPTS CONFIG
    
