lim14373/Archivos-Trabajo-de-Graduaci-n-2018-Swarm-Robotic/Programar PIC32/Programas C/Programas de Prueba/6. Progra Final Versión 2.c
    //Interrupción Timer 1
    IPC1bits.T1IP = 0b111;              // Prioridad de Interrupción 7
    IPC1bits.T1IS = 0b11;               // Sub-Prioridad de Interrupción 3
    
    //Interrupción Timer 4
    IPC4bits.T4IP = 0b111;              // Prioridad de Interrupción 7
    IPC4bits.T4IS = 0b11;               // Sub-Prioridad de Interrupción 3
    
    //Interrupción Timer 5
    IPC5bits.T5IP = 0b111;              // Prioridad de Interrupción 7
    IPC5bits.T5IS = 0b11;               // Sub-Prioridad de Interrupción 3
    
    //Interrupción UART
    IPC8bits.U1IP = 0b111;              // Prioridad de Interrupción 7
    IPC8bits.U1IS = 0b11;               // Sub-Prioridad de Interrupción 3
    
    //Interrupción Change Control Port A y B
    IPC8bits.CNIP = 0b111;              // Prioridad de Interrupción 7
    IPC8bits.CNIS = 0b11;               // Sub-Prioridad de Interrupción 3
    CNENAbits.CNIEA0 = 0b1;             // Change Control pin A0 Interrupt Enabled
    CNPUAbits.CNPUA0 = 0b0;             // Deshabilitar PULL UP en A0
    CNPDAbits.CNPDA0 = 0b1;             // Habilitar PULL DOWN en A0
    CNENAbits.CNIEA1 = 0b1;             // Change Control pin A1 Interrupt Enabled
    CNPUAbits.CNPUA1 = 0b0;             // Deshabilitar PULL UP en A1
    CNPDAbits.CNPDA1 = 0b1;             // Habilitar PULL DOWN en A1
    CNENBbits.CNIEB0 = 0b1;             // Change Control pin B0 Interrupt Enabled
    CNPUBbits.CNPUB0 = 0b0;             // Deshabilitar PULL UP en B0
    CNPDBbits.CNPDB0 = 0b1;             // Habilitar PULL DOWN en B0
    CNENBbits.CNIEB1 = 0b1;             // Change Control pin B1 Interrupt Enabled
    CNPUBbits.CNPUB1 = 0b0;             // Deshabilitar PULL UP en B1
    CNPDBbits.CNPDB1 = 0b1;             // Habilitar PULL DOWN en B1
    CNENAbits.CNIEA2 = 0b0;             // Change Control pin A2 Interrupt Disabled
    CNPUAbits.CNPUA2 = 0b0;             // Deshabilitar PULL UP en A2
    CNPDAbits.CNPDA2 = 0b1;             // Habilitar PULL DOWN en A2
    CNENAbits.CNIEA3 = 0b0;             // Change Control pin A3 Interrupt Disabled
    CNPUAbits.CNPUA3 = 0b0;             // Deshabilitar PULL UP en A3
    CNPDAbits.CNPDA3 = 0b1;             // Habilitar PULL DOWN en A3
    
    CNCONAbits.ON = 0b1;                // Change Control Notice ON portA
    CNCONBbits.ON = 0b1;                // Change Control Notice ON portB
    
    //HABILITACIÓN DE MÓDULOS
    
    OC1CONbits.ON = 0b1;                // OC1 is enabled
    OC2CONbits.ON = 0b1;                // OC2 is enabled
    OC3CONbits.ON = 0b1;                // OC3 is enabled  
    T1CONbits.ON = 0b1;                 // Timer 1 is enabled
    T1CONbits.TON = 0b1;
    T2CONbits.ON = 0b1;                 // Timer 2 is enabled
    T3CONbits.ON = 0b1;                 // Timer 3 is enabled
    T4CONbits.ON = 0b1;                 // Timer 4 is enabled
    T5CONbits.ON = 0b1;                 // Timer 5 is enabled
    U1MODEbits.ON = 0b1;                // UART Enabled
    
    // HABILITACIÓN DE INTERRUPCIONES
    
    IEC0bits.T1IE = 0b1;                // Timer 1 Interrupt Enabled
    IEC1bits.U1RXIE = 0b1;              // UART 1 Receiver Interrupt Enabled
    IEC1bits.CNAIE = 0b1;               // Change Control PortA Interrupt Enabled
    IEC1bits.CNBIE = 0b1;               // Change Control PortB Interrupt Enabled
    
    // INHABILITACIÓN DE INTERRUPCIONES
    
    IEC0bits.T4IE = 0b0;                // Timer 4 Interrupt Disabled
    IEC0bits.T5IE = 0b0;                // Timer 5 Interrupt Disabled
    
    INTCONbits.MVEC = 0b1;              // Interrupt Controller for Multi-Vectored Mode
    
    // LIMPIEZA DE BANDERAS DE INTERRUPCIÓN
    
    IFS0bits.T1IF = 0b0;                // Interruption Flag of Timer 1 to 0
    IFS0bits.T4IF = 0b0;                // Interruption Flag of Timer 4 to 0
    IFS0bits.T5IF = 0b0;                // Interruption Flag of Timer 5 to 0
    IFS1bits.U1RXIF = 0b0;              // Interruption Flag of UART 1 Receiver to 0
    IFS1bits.CNAIF = 0b0;               // Interruption Flag of PORTA to 0
    IFS1bits.CNBIF = 0b0;               // Interruption Flag of PORTB to 0
    
    // LIMPIEZA DE SALIDAS
    
    LATACLR = LED1;
    LATBCLR = LED2;
    LATBCLR = LED3;
   
    __builtin_enable_interrupts();      // Se habilitan las interrupciones
    
    InicializarESP();
    
    while(1)
    {
        if(Revision == 2){
            for(i = 0; i < contR; i++){
                switch (smsR[i]){
                    case 's':
                        SentidoLlantas();
                        i++;
                        break;
                    case 'v':
                        Velocidad();
                        i += 5;
                        break;
                    case 'd':
                        EnviarSentidos();
                        break;
                    case 'p':
                        EnviarPasos();
                        break;
                    case 't':
                        EnviarTiempos();
                        break;
                    case 'r':
                        Radar();
                        break;
                    default:
                        EnviarCadena("AT+CIPSEND=0,8\r\n",16);
                        Enviando = 1;
                        while(Enviando == 1){
                        }
                        EnviarCadena("Error: ",7);
                        EnviarCaracter(smsR[i]);
                        break;
                }
            }
            Revision = 0;
        }
        
        switch(Rutina){
            case 1:
                switch(blink){
                    case 1:
                        LATACLR = LED1;
                        LATBCLR = LED2;
                        LATBCLR = LED3;
                        break;
                    case 2500:
                        LATASET = LED1;
                        LATBSET = LED2;
                        LATBSET = LED3;
                        break;
                    case 5000:
                        LATACLR = LED1;
                        LATBCLR = LED2;
                        LATBCLR = LED3;
                        break;
                    case 7500:
                        LATASET = LED1;
                        LATBSET = LED2;
                        LATBSET = LED3;
                        break;
                    case 10000:
                        LATACLR = LED1;
                        LATBCLR = LED2;
                        LATBCLR = LED3;
                        break;
                    case 12500:
                        LATASET = LED1;
                        LATBSET = LED2;
                        LATBSET = LED3;
                        break;
                    case 15000:
                        LATACLR = LED1;
                        LATBCLR = LED2;
                        LATBCLR = LED3;
                        Rutina = 2;
                        blink = 0;
                        break;
                    default:
                        break;
                }
                break;
            case 2:
                switch(blink){
                    case 1:
                        LATACLR = LED1;
                        LATBCLR = LED2;
                        LATBCLR = LED3;
                        break;
                    case 47550:
                        LATASET = LED1;
                        break;
                    case 47900:
                        LATACLR = LED1;
                        break;
                    case 48250:
                        LATBSET = LED2;
                        break;
                    case 48600:
                        LATBCLR = LED2;
                        break;
                    case 48950:
                        LATBSET = LED3;
                        break;
                    case 49300:
                        LATBCLR = LED3;
                        break;
                    case 49650:
                        LATASET = LED1;
                        break;
                    case 50000:
                        blink = 0;
                        break;
                    default:
                        break;
                }
                break;
        }
    }
    return;
}

// Interrupción para detectar cambio de estado en A0, A1, B0 y B1 para encoders.
void __ISR (34, IPL7SOFT) IntCN(void)
{
    if(CNSTATAbits.CNSTATA0 && PORTAbits.RA0){   //Se activa en el rising del pin 2 - Enc 1A
        
        if(SentidoActualDer == 'f'){
            PasosDerF++;
        }else{
            PasosDerB++;
        }
        
