lim14373/Archivos-Trabajo-de-Graduaci-n-2018-Swarm-Robotic/Programar PIC32/Programas C/Programas de Prueba/6. Progra Final Versión 2.c
        DifTiempos = TiempoActual - TiempoPasadoDer;
        
        TiempoPasadoDer = TiempoActual;
        
        if(DifTiempos < 65000){
            TiemposPasosDer[contTiemposDer++] = DifTiempos;
        }else{
            TiemposPasosDer[contTiemposDer++] = 65000;
        }
        
        if(contTiemposDer == 6){
            contTiemposDer = 0;
        }
        
    }
    if(CNSTATAbits.CNSTATA1 && PORTAbits.RA1){   //Se activa en el rising del pin 3 - Enc 1B
        
        if(PORTAbits.RA0){
            SentidoActualDer = 'b';              //Llanta derecha gira hacia atrás
        }else{
            SentidoActualDer = 'f';              //Llanta derecha gira hacia adelante
        }
        
    }
    if(CNSTATBbits.CNSTATB0 && PORTBbits.RB0){   //Se activa en el rising del pin 4 - Enc 2B
        
        if(PORTBbits.RB1){
            SentidoActualIzq = 'f';              //Llanta derecha gira hacia atrás
        }else{
            SentidoActualIzq = 'b';              //Llanta derecha gira hacia adelante
        }

    }
    if(CNSTATBbits.CNSTATB1 && PORTBbits.RB1){   //Se activa en el rising del pin 5 - Enc 2A
        
        if(SentidoActualIzq == 'f'){
            PasosIzqF++;
        }else{
            PasosIzqB++;
        }
        
        DifTiempos = TiempoActual - TiempoPasadoIzq;
        
        TiempoPasadoIzq = TiempoActual;
        
        if(DifTiempos < 65000){
            TiemposPasosIzq[contTiemposIzq++] = DifTiempos;
        }else{
            TiemposPasosIzq[contTiemposIzq++] = 65000;
        }
        
        if(contTiemposIzq == 6){
            contTiemposIzq = 0;
        }
    }
    
    
    if(CNSTATAbits.CNSTATA2){
        if(PORTAbits.RA2){                              //Se activa en el rising del pin 9 - MaxSonar 1
            ContarSonico1 = 0;
        }else{                                          //Se activa en el falling del pin 9 - MaxSonar 1
            TiempoSonico1 = ContarSonico1;
        }
    }
    
    if(CNSTATAbits.CNSTATA3){
        if(PORTAbits.RA3){                              //Se activa en el rising del pin 10 - MaxSonar 2
            ContarSonico2 = 0;
        }else{                                          //Se activa en el falling del pin 10 - MaxSonar 2
            TiempoSonico2 = ContarSonico2;
        }
    }
    
	IFS1bits.CNAIF = 0b0;                   // Resetear bandera de interrupción
    IFS1bits.CNBIF = 0b0;                   // Resetear bandera de interrupción
}

// Interrupción del Timer 4 se activa cada 50ms
void __ISR (16, IPL7SOFT) IntTimer4(void)
{
    
    Mandar = 1;
	IFS0bits.T4IF = 0;                  // Resetear bandera de interrupción
}

// Interrupción del Timer 5 se activa cada 25us
void __ISR (20, IPL7SOFT) IntTimer5(void)
{    
    ContarSonico1++;
    ContarSonico2++;
    
	IFS0bits.T5IF = 0;                  // Resetear bandera de interrupción
}

void Radar(void){
    
    EnviarCadena("r\r\n",3);
    
    OC2RS = 4000;
    
    __builtin_disable_interrupts();
    
    IEC0bits.T4IE = 0b1;                // Timer 4 Interrupt Enabled
    IEC0bits.T5IE = 0b1;                // Timer 5 Interrupt Enabled
    
    IEC1bits.CNAIE = 0b0;               // Change Control PortA Interrupt Disabled
    CNENAbits.CNIEA2 = 0b1;             // Change Control pin A2 Interrupt Enabled
    CNENAbits.CNIEA3 = 0b1;             // Change Control pin A3 Interrupt Enabled
    IEC1bits.CNAIE = 0b1;               // Change Control PortA Interrupt Enabled
    
    IFS0bits.T4IF = 0b0;                // Interruption Flag of Timer 4 to 0
    IFS0bits.T5IF = 0b0;                // Interruption Flag of Timer 5 to 0
    IFS1bits.CNAIF = 0b0;               // Interruption Flag of PORTA to 0
    
    __builtin_enable_interrupts();
    
    Grados = 0;
    
    blink = 0;
    
    while(Grados < 146){
        if(Mandar == 1){
            Mandar = 0;
            
            dmil = Grados;
            
            cen = dmil/100;
            dmil -= cen*100;
            dec = dmil/10;
            dmil -= dec*10;
            uni = dmil;
            
            dmil = TiempoSonico1;
            
            U1TXREG = cen+48;
            while (!U1STAbits.TRMT);                //espera a que termine la transimision
            U1TXREG = dec+48;
            while (!U1STAbits.TRMT);                //espera a que termine la transimision
            U1TXREG = uni+48;
            while (!U1STAbits.TRMT);                //espera a que termine la transimision
            U1TXREG = '\t';
            while (!U1STAbits.TRMT);                //espera a que termine la transimision
            
            mil = dmil/1000;
            dmil -= mil*1000;
            cen = dmil/100;
            dmil -= cen*100;
            dec = dmil/10;
            dmil -= dec*10;
            uni = dmil;
            
            dmil = TiempoSonico2;
            
            U1TXREG = mil+48;
            while (!U1STAbits.TRMT);                //espera a que termine la transimision
            U1TXREG = cen+48;
            while (!U1STAbits.TRMT);                //espera a que termine la transimision
            U1TXREG = dec+48;
            while (!U1STAbits.TRMT);                //espera a que termine la transimision
            U1TXREG = uni+48;
            while (!U1STAbits.TRMT);                //espera a que termine la transimision
            U1TXREG = '\t';
            while (!U1STAbits.TRMT);                //espera a que termine la transimision
            
            mil = dmil/1000;
            dmil -= mil*1000;
            cen = dmil/100;
            dmil -= cen*100;
            dec = dmil/10;
            dmil -= dec*10;
            uni = dmil;
            
            U1TXREG = mil+48;
            while (!U1STAbits.TRMT);                //espera a que termine la transimision
            U1TXREG = cen+48;
            while (!U1STAbits.TRMT);                //espera a que termine la transimision
            U1TXREG = dec+48;
            while (!U1STAbits.TRMT);                //espera a que termine la transimision
            U1TXREG = uni+48;
            while (!U1STAbits.TRMT);                //espera a que termine la transimision
            U1TXREG = '\r';
            while (!U1STAbits.TRMT);                //espera a que termine la transimision
            U1TXREG = '\n';
            while (!U1STAbits.TRMT);                //espera a que termine la transimision
            
            Grados++;
        }
        
        switch(blink){
            case 1:
                LATACLR = LED1;
                LATBCLR = LED2;
                LATBCLR = LED3;
                break;
            case 500:
                LATASET = LED1;
                break;
            case 1000:
                LATACLR = LED1;
                break;
            case 1500:
                LATBSET = LED2;
                break;
            case 2000:
                LATBCLR = LED2;
                break;
            case 2500:
                LATBSET = LED3;
                break;
            case 3000:
                blink = 0;
                break;
            default:
                break;
        }
    }
    
    blink = 0;
    
    TiempoSonico1 = 0;
    TiempoSonico2 = 0;
    
    OC2RS = 4000;
    
    __builtin_disable_interrupts();
    
