lim14373/Archivos-Trabajo-de-Graduaci-n-2018-Swarm-Robotic/Programar PIC32/Programas C/Programas de Prueba/6. Progra Final Versión 2.c
    IEC0bits.T4IE = 0b0;                // Timer 4 Interrupt Disabled
    IEC0bits.T5IE = 0b0;                // Timer 5 Interrupt Disabled
    
    IEC1bits.CNAIE = 0b0;               // Change Control PortA Interrupt Disabled
    CNENAbits.CNIEA2 = 0b0;             // Change Control pin A2 Interrupt Disabled
    CNENAbits.CNIEA3 = 0b0;             // Change Control pin A3 Interrupt Disabled
    IEC1bits.CNAIE = 0b1;               // Change Control PortA Interrupt Enabled
    
    IFS0bits.T4IF = 0b0;                // Interruption Flag of Timer 4 to 0
    IFS0bits.T5IF = 0b0;                // Interruption Flag of Timer 5 to 0
    IFS1bits.CNAIF = 0b0;               // Interruption Flag of PORTA to 0
    
    __builtin_enable_interrupts();
    
}

// Interrupción del Timer 1 se activa cada 0.1ms
void __ISR (4, IPL7SOFT) IntTimer1(void)
{
    
    if(InitESP == 1){
        blink++;
    }
    
    if(Grados < 146){
        g++;
        if(g == 10){
            g = 0;
            OC2RS++;  
        }
    }
    
    TiempoActual++;
    
	IFS0bits.T1IF = 0;                  // Resetear bandera de interrupción
}

// Interrupción del UART Transmisión y Recepción
void __ISR (32, IPL7SOFT) IntUart1(void)
{
    charIn = U1RXREG;
    
    if(Enviando == 1 && charIn == '>'){
        Enviando = 0;
    }
    
    if(InitESP == 0){
        if(charIn != '\n' && charIn != '\r'){
            smsR[contR++] = charIn;
        }else if(charIn == '\n'){
            Revision = 1;
            contR = 0;
        }        
    }else if (Revision == 1){
        if(charIn != '%' && charIn != '\n' && charIn != '\r' && contR < 50){
            smsR[contR++] = charIn;
        }else if(charIn == '\n' || charIn == '%'){
            Revision = 2;
        }
    }else if(charIn == ':'){
        Revision = 1;
        contR = 0;
    }

    IFS1bits.U1RXIF = 0b0;
}

//ENVIAR CARACTER POR SERIAL
void EnviarCaracter(char c) {
    __builtin_disable_interrupts();
    U1TXREG = c;
    while (!U1STAbits.TRMT);                //espera a que termine la transimision
    __builtin_enable_interrupts();
}

//ENVIAR STRING POR SERIAL
void EnviarCadena(char p[], int a){
    for(k = 0; k < a; k++){
        EnviarCaracter(p[k]); 
    }
}

//Modifica el sentido en el que giran las llantas
void SentidoLlantas(void){
    
    switch(smsR[i+1]){
        case '1':            // Llantas hacia adelante
            LATBCLR = BDOS;
            LATBSET = BUNO;
            LATBCLR = AUNO;
            LATBSET = ADOS;
            break;
        case '2':            // Llanta derecha hacia adelante, izquierda hacia atrás
            LATBSET = BDOS;
            LATBCLR = BUNO;
            LATBCLR = AUNO;
            LATBSET = ADOS;
            break;
        case '3':            // Llanta derecha hacia atrás, izquierda hacia adelante
            LATBCLR = BDOS;
            LATBSET = BUNO;
            LATBSET = AUNO;
            LATBCLR = ADOS;
            break;
        case '4':            // Llantas hacia atrás
            LATBSET = BDOS;
            LATBCLR = BUNO;
            LATBSET = AUNO;
            LATBCLR = ADOS;
            break;
        default:
            break;
    }
    
    EnviarCadena("s\r\n",3);
    
}

// Modifica la velocidad de la llanta derecha o izquierda
void Velocidad(void){
     
    var = (smsR[i+2]-48)*1000 + (smsR[i+3]-48)*100 + (smsR[i+4]-48)*10 + smsR[i+5] - 48;
    
    if(var > 4500){
        var = 4500;
    }else if(var < 0){
        var = 0;
    }
    
    switch(smsR[i+1]){
        case 'd':
            OC1RS = var;
            break;
        case 'i':
            OC3RS = var;
            break;
        default:
            break;
    }
    
    EnviarCadena("v\r\n",3);
    
}

//Envía los pasos recorridos por las llantas
void EnviarPasos(void){
    
    EnviarCadena("p\r\n",3);
    
    dmil = PasosDerF/10000;
    PasosDerF -= dmil*10000;
    mil = PasosDerF/1000;
    PasosDerF -= mil*1000;
    cen = PasosDerF/100;
    PasosDerF -= cen*100;
    dec = PasosDerF/10;
    PasosDerF -= dec*10;
    uni = PasosDerF;
    PasosDerF -= uni;
    
    EnviarCadena("F\tD: ",5);
    EnviarCaracter(dmil+48);
    EnviarCaracter(mil+48);
    EnviarCaracter(cen+48);
    EnviarCaracter(dec+48);
    EnviarCaracter(uni+48);
    
    dmil = PasosIzqF/10000;
    PasosIzqF -= dmil*10000;
    mil = PasosIzqF/1000;
    PasosIzqF -= mil*1000;
    cen = PasosIzqF/100;
    PasosIzqF -= cen*100;
    dec = PasosIzqF/10;
    PasosIzqF -= dec*10;
    uni = PasosIzqF;
    PasosIzqF -= uni;
    
    EnviarCadena("\tI: ",4);
    EnviarCaracter(dmil+48);
    EnviarCaracter(mil+48);
    EnviarCaracter(cen+48);
    EnviarCaracter(dec+48);
    EnviarCaracter(uni+48);
    
    dmil = PasosDerB/10000;
    PasosDerB -= dmil*10000;
    mil = PasosDerB/1000;
    PasosDerB -= mil*1000;
    cen = PasosDerB/100;
    PasosDerB -= cen*100;
    dec = PasosDerB/10;
    PasosDerB -= dec*10;
    uni = PasosDerB;
    PasosDerB -= uni;
    
    EnviarCadena("\nB\tD: ",6);
    EnviarCaracter(dmil+48);
    EnviarCaracter(mil+48);
    EnviarCaracter(cen+48);
    EnviarCaracter(dec+48);
    EnviarCaracter(uni+48);
    
    dmil = PasosIzqB/10000;
    PasosIzqB -= dmil*10000;
    mil = PasosIzqB/1000;
    PasosIzqB -= mil*1000;
    cen = PasosIzqB/100;
    PasosIzqB -= cen*100;
    dec = PasosIzqB/10;
    PasosIzqB -= dec*10;
    uni = PasosIzqB;
    PasosIzqB -= uni;
    
    EnviarCadena("\tI: ",4);
    EnviarCaracter(dmil+48);
    EnviarCaracter(mil+48);
    EnviarCaracter(cen+48);
    EnviarCaracter(dec+48);
    EnviarCaracter(uni+48);
    
    EnviarCadena("\r\n",2);
    
}

//Envía en qué sentido están girando las llantas
void EnviarSentidos(void){

    EnviarCadena("d\r\n",3);
    
    EnviarCadena("D: ",3);
    EnviarCaracter(SentidoActualDer);
    EnviarCadena("\tI: ",4);
    EnviarCaracter(SentidoActualIzq);
    
    EnviarCadena("\r\n",2);
    
